In [1]:
import mysql.connector as connection
mydb = connection.connect(host = "localhost",database = 'mydatabase',user = "root",passwd = "Vishal@9850",use_pure = True )
cursor = mydb.cursor()
cursor.execute("select * from customer where address = 'Watapur,Newasa' ")
res = cursor.fetchall()
print(res)

[(1, 'Vishal', 'Watapur,Newasa', None)]

In [2]:
mydb.commit()
cur = mydb.cursor()
cur.execute("select * from customer where address like '%way%' ")
result = cur.fetchall()
print(result)

[(12, 'Susan', 'One way 98', None)]

In [3]:
mydb.commit()
cur1 = mydb.cursor()
cur1.execute(" select * from customer where address like '%r' ")
res1 = cur1.fetchall()
#print(res1)
for i in res1 :
    print(i)

In [4]:
mydb.commit()
cur2 = mydb.cursor()
cur2.execute(" select * from customer where address like 's%'")
res = cur2.fetchall()
print(res)

[(11, 'Richard', 'Sky st 331', None)]

#### ORDER BY

In [5]:
import pandas as pd

In [6]:
mydb = connection.connect(host = "localhost",database = 'mydatabase',user = "root",passwd = "Vishal@9850",use_pure = True )
cursor = mydb.cursor()
a = pd.read_sql("select * from customer order by name ASC",mydb)
a

    id     name          address country
0    6      Amy     Apple st 652    None
1   10    Betty    Green Grass 1    None
2    7   Hannah      Mountain 21    None
3    8  Michael       Valley 345    None
4    5    Peter      Lowstreet 4    None
5    2  Radhika        Pachegoan    None
6    4      Raj           Nashik    None
7   11  Richard       Sky st 331    None
8   14       Ro        Nashik-02    None
9    9    Sandy     Ocean blvd 2    None
10  12    Susan       One way 98    None
11  13    Vicky  Yellow Garden 2    None
12  16     Viky                     None
13   1   Vishal   Watapur,Newasa    None

#### Delete

In [7]:
mydb.commit()
cur1 = mydb.cursor()
cur1.execute(" delete from customer where address = 'Rahuri' ")
cur1.fetchall()

[]

In [8]:
print(cur1.rowcount,"record deleted")

0 record deleted

####  UPDATE

In [9]:
mydb.commit()
cur2 = mydb.cursor()
cur2.execute("update customer set address = 'Watapur,Newasa' where address = 'Ahmednagar' ")

In [10]:
mydb.commit()

In [11]:
print("One record updated has ID : ", cur2.lastrowid)

One record updated has ID :  0

In [12]:
mydb.commit()

#### LIMIT AND OFFSET

In [13]:
cur3 = mydb.cursor()
a = pd.read_sql("select name,address from customer limit 5",mydb)
a

      name         address
0   Vishal  Watapur,Newasa
1  Radhika       Pachegoan
2      Raj          Nashik
3    Peter     Lowstreet 4
4      Amy    Apple st 652

In [14]:
b = pd.read_sql("select name,address from customer limit 5 offset 3",mydb)
b

      name       address
0    Peter   Lowstreet 4
1      Amy  Apple st 652
2   Hannah   Mountain 21
3  Michael    Valley 345
4    Sandy  Ocean blvd 2